---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.ConceptualConstructionId
source: html/c496d32e-ed1d-5aa2-d342-e9f40a67252e.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.ConceptualConstructionId Property

The id of the conceptual construction associated with the reference surface.

## Syntax (C#)
```csharp
public ElementId ConceptualConstructionId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input element conceptualConstructionId is not a valid ConceptualConstructionType element id.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null